package day023_260806_JAVA;

public class JAVA_exam1 {

    public static void main(String[] args) {
        
        /*
            [ 생성자 ]
                1) 인스턴스(객체) 생성할 때 초기화 담당
                    - new 생성자명( )

                2) 사용법
                    1. 클래스 내부 선언
                    2. 클래스명 동일
                    3. 반환타입 없다
                    4. 오버로딩 지원 ( 동일한 이름의 서로 다른 매개변수의 개수/타입/순서 달라도 중복 가능)
                        - 오버라이딩 이랑 다름

                3) 목적 : 객체생성시 초기화 , 협업간의 규칙/유효성검사

                4) 주의
                    - 정의한 클래스 안에 생성자가 1개도 없으면 기본생성자를 자동 제동
                
                5) this : 멤버변수와 매개변수 이름이 동일한 경우 멤버변수를 가리킴

                * 클래스 내부에서 우클릭  =>  소스작업(source Action)  =>  constructor  =>  멤버변수 체크  =>  [확인]
            
        */













    }
}
