/*
    .java 파일 만들기
        1. src 폴더 오른쪽 클릭
        2. [new java file]  ->  [class]
        3. 첫글자가 대문자 영문으로 시작하는 클래스명 임의
    
    자바 주석 == 자바스크립트 주석 동일
        // 한줄 주석
*/

package day016_260728_JAVA;  // 패키지(폴더명) 이면서 클래스의 위치 식별용도

public class JAVA_exam1 { 
    // public : 공개용, 다른패키지에서도 사용 가능한 클래스 뜻
    // class : 클래스 선언 사용하는 키워드
    // JAVA_exam1 : 클래스명은 아무거나, 단 첫글자는 대문자
        // 클래스란? 자바에서의 가장 최소 컴파일/번역/통역사 단위
    // { 클래스 시작 뜻 , } 클래스 끝 뜻  *클래스 { } 안에서만 코드 작성할 것  

    // [ 클래스 안 & main함수 밖 ] 선언/만들기만 가능  /  실행문 불가능
    // System.out.println("안녕하세요");  ==>  오류 발생
    int a = 10;  // 가능

    // [1] 자바 실행 시작점 생성 , main함수( 메인스레드 : 번역한 코드를 읽는 흐름 단위 )
    // main + 엔터/탭  :  main{ } 자동완성    *JS 에 없는 이유는 브라우저 엔진이 대신한다.
    public static void main(String[] args) { // main start
        
        // ** [ main 함수 안 ] 선언/만들기  ,  실행문 가능 **
        int b = 10;  // 가능

        // [2] 콘솔에 출력문 실행하기
        // sout + 엔터/탭  = JS의 console.log( ) 와 동일한 역할
        System.out.println("안녕하세요");  // 무조건 "" 만 가능  '' 나 `` 불가능

        // [3] 세미콜론 ;  코드의 한 문장이 끝났다는 뜻, 해당 기준으로 컴파일을 한다.


    } // main end

} // class end


// * class 밖에서는 코드를 작성하지 말 것 *

